.doom.d/Emacs.org
** Multiple Cursors
#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("m" . "Multiple Cursors")
          :desc "mc/mark-next-like-this" "n" #'mc/mark-next-like-this
          :desc "mc/mark-previous-like-this" "p" #'mc/mark-previous-like-this
          :desc "mc/mark-all-like-this" "a" #'mc/mark-all-like-this)))

(map! :after multiple-cursors-mode
      :map multiple-cursors-map
      "C-n" 'mc/mark-next-like-this
      "C-p" 'mc/mark-previous-like-this
      "C-a" 'mc/mark-all-like-this)
;; (when (modulep! :editor multiple-cursors)
;;   (map! "C->"   #'mc/mark-next-like-this
;;         "C-<"   #'mc/mark-previous-like-this
;;         "C-M->" #'mc/skip-to-next-like-this
;;         "C-M-<" #'mc/skip-to-previous-like-this
;;         "M-<mouse-1>" #'mc/add-cursor-on-click)
;;   (map! :leader
;;         :prefix "m"
;;         :desc "Pop mark"                        "SPC"   #'mc/mark-pop
;;         :desc "Mark all above"                  "<"     #'mc/mark-all-above
;;         :desc "Mark all below"                  ">"     #'mc/mark-all-below
;;         :desc "Mark words like this"            "W"     #'mc/mark-all-words-like-this
;;         :desc "Mark symbols like this"          "S"     #'mc/mark-all-symbols-like-this
;;         :desc "Mark words like this in defun"   "C-w"   #'mc/mark-all-words-like-this-in-defun
;;         :desc "Mark symbols like this in defun" "C-s"   #'mc/mark-all-symbols-like-this-in-defun
;;         :desc "Mark next sexps"                 "C-M-f" #'mc/mark-next-sexps
;;         :desc "Mark previous sexps"             "C-M-b" #'mc/mark-previous-sexps
;;         :desc "Mark regexp"                     "%"     #'mc/mark-all-in-region-regexp)
;;   (after! multiple-cursors-core
;;     (dolist (cmd '(doom/delete-backward-word
;;                    doom/forward-to-last-non-comment-or-eol mark-sexp
;;                    eros-eval-last-sexp eval-last-sexp cae-eval-last-sexp
;;                    forward-sentence backward-sentence kill-sentence
;;                    sentex-forward-sentence sentex-backward-sentence
;;                    sentex-kill-sentence parrot-rotate-next-word-at-point
;;                    cae-delete-char cae-modeline-rotate-next-word-at-point
;;                    cae-modeline-rotate-prev-word-at-point
;;                    forward-sexp backward-sexp backward-list forward-list))
;;       (add-to-list 'mc/cmds-to-run-for-all cmd))
;;     (dolist (cmd '(+workspace/new +workspace/load +workspace/save
;;                    +workspace/cycle +workspace/other +workspace/delete
;;                    +workspace/rename +workspace/display +workspace/new-named
;;                    +workspace/swap-left +workspace/switch-to
;;                    +workspace/swap-right +workspace/switch-left
;;                    +workspace/switch-to-0 +workspace/switch-to-1
;;                    +workspace/switch-to-2 +workspace/switch-to-3
;;                    +workspace/switch-to-4 +workspace/switch-to-5
;;                    +workspace/switch-to-6 +workspace/switch-to-7
;;                    +workspace/switch-to-8 +workspace/kill-session
;;                    +workspace/switch-right +workspace/switch-to-final
;;                    +workspace/restore-last-session +workspace/kill-session-and-quit
;;                    +workspace/close-woutdow-or-workspace read-only-mode
;;                    save-buffers-kill-terminal))
;;       (add-to-list 'mc/cmds-to-run-once cmd))
;;     (dolist (mode '(cae-completion-mode symbol-overlay-mode goggles-mode
;;                     lispy-mode corfu-mode hungry-delete-mode
;;                     worf-mode isearch-mb-mode))
;;       (add-to-list 'mc/unsupported-minor-modes mode))
;;     (define-key mc/keymap (kbd "C-. .")     #'mc/move-to-column)
;;     (define-key mc/keymap (kbd "C-. =")     #'mc/compare-chars)
;;     (define-key mc/keymap (kbd "C-. C-.")   #'mc/freeze-fake-cursors-dwim)
;;     (define-key mc/keymap (kbd "C-. C-d")   #'mc/remove-current-cursor)
;;     (define-key mc/keymap (kbd "C-. C-k")   #'mc/remove-cursors-at-eol)
;;     (define-key mc/keymap (kbd "C-. C-o")   #'mc/remove-cursors-on-blank-lines)
;;     (define-key mc/keymap (kbd "C-. d")     #'mc/remove-duplicated-cursors)
;;     (define-key mc/keymap (kbd "C-. l")     #'mc/insert-letters)
;;     (define-key mc/keymap (kbd "C-. n")     #'mc/insert-numbers)
;;     (define-key mc/keymap (kbd "C-. s")     #'mc/sort-regions)
;;     (define-key mc/keymap (kbd "C-. r")     #'mc/reverse-regions)
;;     (define-key mc/keymap (kbd "C-. [")     #'mc/vertical-align-with-space)
;;     (define-key mc/keymap (kbd "C-. {")     #'mc/vertical-align)))
#+end_src

* Chinese
#+begin_src emacs-lisp :tangle packages.el
(package! pyim)
(package! pyim-basedict)
#+end_src

* Shortcuts to load modules, as needed

To create new loadable modules,

#+begin_src emacs-lisp
(load! "./blw-func/define-modules.el")
#+end_src

#+RESULTS:
: t

#+begin_src emacs-lisp
(load! "./blw-func/load-modules.el")
#+end_src

#+RESULTS:
: t

#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("l" . "load module")
        :desc "Chinese" "c" #'blw/load-chinese
        :desc "LaTeX" "l" #'blw/load-latex)))
#+end_src

* Datomic snippets?
#+begin_src emacs-lisp :tangle packages.el
;; (package! datomic-snippets)
#+end_src
* Current time function

#+begin_src emacs-lisp
(load! "./blw-func/isosec.el")
#+end_src

#+RESULTS:
: t

#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("z" . "Zettle funcs")
          :desc "Isosec" "i" #'blw/insert-current-isosec)))
#+end_src
#+RESULTS:
: blw/insert-current-isosec
* Markdown
#+begin_src emacs-lisp :tangle packages.el
(package! flymd)
#+end_src
* EPUB readeR
#+begin_src emacs-lisp :tangle packages.el
(package! nov)
  ;; :recipe (:host github
  ;;          :repo "emacs-pe/nov.el"))
#+end_src

#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix-map ("r" . "read")
        :desc "EPUB refresh size" "r" #'nov-render-document)))
#+end_src

#+RESULTS:
: nov-render-document
* Emoji
#+begin_src emacs-lisp :tangle packages.el
(package! emojify)
#+end_src

* Fixes
#+begin_src emacs-lisp :tangle packages.el
(package! pyim-basedict)
(package! pyim)
(package! bing-dict)
(package! zh-align
  :recipe (:host github
           :repo "chen-chao/zh-align.el"))
(package! doom-themes)
(package! evil-collection)
(package! bing-dict)
(package! straight :pin "3eca39d")
#+end_src

#+begin_src emacs-lisp
(load! "./blw-func/fast-input-method.el")
(evil-mode)
#+end_src

* RevealJS
#+begin_src emacs-lisp :tangle packages.el
(package! ox-reveal)
(package! impatient-mode)
;; (package! httpd)
#+end_src

#+begin_src emacs-lisp
(require 'ox-reveal)
#+end_src
#
# #+RESULTS:
# : ox-reveal
#+begin_src emacs-lisp
;; (use-package impatient-mode)
#+end_src
* JavaScript
** Eslint
#+begin_src emacs-lisp :tangle packages.el
(package! eslint-rc)
(package! setup)
;; (use-package! flymake-eslint
;;   :config
;;   (add-hook web-mode-hook flymake-eslint-enable))
#+end_src

#+begin_src emacs-lisp
(add-hook 'typescript-mode-hook 'eslint-rc-mode)
(add-hook 'js2-mode-hook 'eslint-rc-mode)
(add-hook 'web-mode-hook 'eslint-rc-mode)
#+end_src

deprecated -- reason: f **facti**
#+begin_src emacs-lisp :tangle ~/dotfiles/.config/facti/.dir-local.el
;; dir-local.el for facti's js setup
;; ((rjsx-mode . ((eval . (setq js-indent-level 2))
;;                (eval . (setq indent-tabs-mode nil))
;;                (eval . (setq tab-width 4))
;;                (eval . (setq indent-line-function 'insert-tab)))))
#+end_src

** Hooks
#+begin_src emacs-lisp
(add-hook 'rjsx-mode-hook 'tide-mode)
#+end_src

** JSX
#+begin_src emacs-lisp
;; use web-mode for .jsx files
(add-to-list 'auto-mode-alist '("\\.jsx$" . web-mode))

;; http://www.flycheck.org/manual/latest/index.html
(require 'flycheck)

;; turn on flychecking globally
(add-hook 'after-init-hook #'global-flycheck-mode)

;; disable jshint since we prefer eslint checking
(setq-default flycheck-disabled-checkers
  (append flycheck-disabled-checkers
    '(javascript-jshint)))

;; use eslint with web-mode for jsx files
(flycheck-add-mode 'javascript-eslint 'web-mode)

;; customize flycheck temp file prefix
(setq-default flycheck-temp-prefix ".flycheck")

;; disable json-jsonlist checking for json files
(setq-default flycheck-disabled-checkers
  (append flycheck-disabled-checkers
    '(json-jsonlist)))

;; https://github.com/purcell/exec-path-from-shell
;; only need exec-path-from-shell on OSX
;; this hopefully sets up path and other vars better
(when (memq window-system '(mac ns))
  (exec-path-from-shell-initialize))
#+end_src

#+begin_src emacs-lisp
(add-hook 'web-mode-hook 'lsp-defered)
#+end_src

#+RESULTS:
| lsp-defered | er/add-web-mode-expansions | er/add-html-mode-expansions | +web--fix-js-comments-h | eslint-rc-mode | doom--enable-+web-wordpress-mode-in-web-mode-h | doom--enable-+web-django-mode-in-web-mode-h | doom--enable-+web-jekyll-mode-in-web-mode-h | emmet-mode | doom--enable-+javascript-npm-mode-in-web-mode-h |
** Indium
#+begin_src emacs-lisp :tangle packages.el
(package! indium)
#+end_src

** Slime-js
#+begin_src emacs-lisp :tangle packages.el
;; (package! sly :disable t)
;; (package! sly-macrostep :disable t)
;; (package! sly-repl-ansi-color :disable t)
;; (package! slime)
;; (package! slime-js
;;         :recipe (:host github
;;                  :repo "swank-js/swank-js"))
#+end_src

#+begin_src emacs-lisp
;; (use-package! slime
;;   :config (setq inferior-lisp-program "sbcl"))
#+end_src

#+RESULTS:
: t

** Keymaps
#+begin_src emacs-lisp
(defun insert-file-name ()
  "Insert the full path file name into the current buffer."
  (interactive)
  (insert (concat (buffer-file-name (window-buffer (minibuffer-selected-window))) " " (what-line))))
#+end_src

#+RESULTS:
: insert-file-name

#+begin_src emacs-lisp
(map! :after evil-mode
      :map tide-mode-map
      "C-." nil)

(map! :map tide-mode-map
      "C-." 'tide-jump-to-definition
      "C-," 'tide-jump-back)
#+end_src


#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("j" . "javascript")
        :desc "go-to definition" "." #'tide-jump-to-definition
        :desc "go-to implementation" "," #'tide-jump-implementation
        :desc "back from go-to" "," #'tide-jump-back)))

;; Insert file name:
;; To easily point out stuff in files, in documentation processes
;; and team alignments etc.

(map! :leader
      (:prefix-map ("b" . "buddhi")
       :desc "insert file name" "n" #'insert-file-name))
#+end_src

#+RESULTS:
: insert-file-name

* General Web Dev
** Keymaps
#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("w" . "web")
        :desc "attribute match" "m" #'web-mode-tag-match)))
#+end_src

* Copilot
#+begin_src emacs-lisp :tangle packages.el
;; (package! copilot
;;   :recipe (:host github :repo "zerolfx/copilot.el" :files ("*.el" "dist")))

  ;; :pin "0160a1108b3bc3fff7e9fe1ebb67e71c0c2a334d")
#+end_src

#+begin_src emacs-lisp
;; accept completion from copilot and fallback to company
;; (use-package! copilot
;;   :hook (prog-mode . copilot-mode)
;;   :bind (("C-TAB" . 'copilot-accept-completion-by-word)
;;          ("C-<tab>" . 'copilot-accept-completion-by-word)
;;          :map copilot-completion-map
;;          ("<tab>" . 'copilot-accept-completion)
;;          ("TAB" . 'copilot- accept-completion)))
#+end_src

** Keymaps
#+begin_src emacs-lisp
;; (map! :leader
;;       (:prefix-map ("b" . "buddhi")
;;        (:prefix ("c" . "Complete")
;;         :desc "Accept full completion" "TAB" #'copilot-accept-completion)))

;; (map! :leader
;;       (:prefix-map ("b" . "buddhi")
;;         :desc "Accept full completion" "TAB" #'copilot-accept-completion))
#+end_src

#+RESULTS:
: copilot-accept-completion

#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       :desc "Yasnippet" "y" #'company-yasnippet))

;; (map! :leader
;;       (:prefix-map ("b" . "buddhi")
;;        (:prefix ("c" . "Complete")
;;         :desc "Accept full completion" "TAB" #'+company/complete)))
#+end_src

* Pomodoro
#+begin_src emacs-lisp
;; From  time.el -> display-time-mode
(defun blw/display-time-event-handler ()
  (display-time-update)
  (let* ((current (current-time))
	 (timer display-time-timer)
	 ;; Compute the time when this timer will run again, next.
	 (next-time (timer-relative-time
		     (list (aref timer 1) (aref timer 2) (aref timer 3))
		     (* 5 (aref timer 4)) 0)))
    ;; If the activation time is not in the future,
    ;; skip executions until we reach a time in the future.
    ;; This avoids a long pause if Emacs has been suspended for hours.
    (or (time-less-p current next-time)
	(progn
	  (timer-set-time timer (timer-next-integral-multiple-of-time current display-time-interval) display-time-interval)
	  (timer-activate timer)))))

(defun blw/timer-pomo ()
  (let ((pomo-output (shell-command-to-string "sb-pomo | tr -d '\n'")))
    (if (equal "" pomo-output)
        (progn
          (cancel-function-timers 'blw/timer-pomo)
          (setq-default mode-line-misc-info "No pomodoro running"))
        (setq-default mode-line-misc-info pomo-output))))

(defun blw/pomodoro-echo ()
  (interactive
   (run-with-timer 0 1 'blw/timer-pomo)
   (run-at-time t 1 'blw/display-time-event-handler)))

(defun blw/kill-pomo-updates ()
  (interactive
   (progn
     (cancel-function-timers 'blw/timer-pomo)
     (cancel-function-timers 'blw/display-time-event-handler)
     (setq-default mode-line-misc-info nil))))
#+end_src

