.doom.d/Emacs.org
* Org
#+begin_src emacs-lisp :tangle packages.el
(package! org-bullets)
(package! org-superstar)
#+end_src

#+begin_src emacs-lisp
(use-package! org-bullets
  :after org
  ;; :hook (org-mode . org-bullets)
  :custom
  ;; (org-superstar-remove-leading-stars t)
  (org-bullets-bullet-list '("家" "ॐ" "同" "Ø" "א" "҉ " "҈ ")))

(use-package! org-superstar
  ;; :if (not dw/is-termux)
  :after org
  :hook (org-mode . org-superstar-mode)
  :custom
  (org-superstar-remove-leading-stars t)
  (org-superstar-headline-bullets-list '("家" "ॐ" "同" "Ø" "א" "҉ " "҈ ")))
                                       ;; Make sure org-indent face is available
(require 'org-indent)
;; (require 'org-indent
;; Ensure that anything that should be fixed-pitch in Org files appears that way
(set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
(set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
(set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
(set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
(set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

;; Get rid of the background on column views
(set-face-attribute 'org-column nil :background nil)
(set-face-attribute 'org-column-title nil :background nil)
#+end_src

#+begin_src emacs-lisp :tangle packages.el
(package! org-present)
#+end_src

#+begin_src emacs-lisp
;; Install visual-fill-column
(unless (package-installed-p 'visual-fill-column)
  (package-install 'visual-fill-column))


(defun dw/org-present-start ()
  ;; Center the presentation and wrap lines
  (visual-fill-column-mode 1)
  (visual-line-mode 1))

(defun dw/org-present-end ()
  ;; Stop centering the document
  (visual-fill-column-mode 0)
  (visual-line-mode 0))


(defun dw/org-present-prepare-slide ()
  (org-overview)
  (org-show-entry)
  (org-show-children))

(defun dw/org-present-hook ()
       ;; Configure fill width
  (setq visual-fill-column-width 110
      visual-fill-column-center-text t)
  (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
					  (header-line (:height 4.0) variable-pitch)
					  (org-document-title (:height 1.75) org-document-title)
					  (org-code (:height 1.55) org-code)
					  (org-verbatim (:height 1.55) org-verbatim)
					  (org-block (:height 1.40) org-block)
					  (org-block-begin-line (:height 0.7) org-block)))
  (setq header-line-format " ")
  (org-appear-mode -1)
  (org-display-inline-images)
  (dw/org-present-prepare-slide))

(defun dw/org-present-quit-hook ()
  (setq-local face-remapping-alist '((default variable-pitch default)))
  (setq header-line-format nil)
  (org-present-small)
  (org-remove-inline-images)
  (org-appear-mode 1))

(defun dw/org-present-prev ()
  (interactive)
  (org-present-prev)
  (dw/org-present-prepare-slide))

(defun dw/org-present-next ()
  (interactive)
  (org-present-next)
  (dw/org-present-prepare-slide))

(use-package! org-present
  :bind (:map org-present-mode-keymap
		   ("C-c C-j" . dw/org-present-next)
		   ("C-c C-k" . dw/org-present-prev))
  :hook ((org-present-mode . dw/org-present-hook)
     (org-present-mode-quit . dw/org-present-quit-hook)
     (org-present-mode-hook . dw/org-present-start)
     (org-present-mode-quit-hook . dw/org-present-end)))
;; Register hooks with org-present
;; (add-hook 'org-present-mode-hook 'my/org-present-start)
;; (add-hook 'org-present-mode-quit-hook 'my/org-present-end)
#+end_src


#+begin_src emacs-lisp
;;; Theme and Fonts ----------------------------------------

;; ;; Install doom-themes
;; (unless (package-installed-p 'doom-themes)
;;   (package-install 'doom-themes))

;; ;; Load up doom-palenight for the System Crafters look
;; (load-theme 'doom-palenight t)

;; ;; Set reusable font name variables
;; (defvar my/fixed-width-font "JetBrains Mono"
;;   "The font to use for monospaced (fixed width) text.")

;; (defvar my/variable-width-font "Iosevka Aile"
;;   "The font to use for variable-pitch (document) text.")

;; ;; NOTE: These settings might not be ideal for your machine, tweak them as needed!
;; (set-face-attribute 'default nil :font my/fixed-width-font :weight 'light :height 100)
;; (set-face-attribute 'fixed-pitch nil :font my/fixed-width-font :weight 'light :height 110)
;; (set-face-attribute 'variable-pitch nil :font my/variable-width-font :weight 'light)

;;; Org Mode Appearance ------------------------------------

;; Load org-faces to make sure we can set appropriate faces
(require 'org-faces)

;; Hide emphasis markers on formatted text
(setq org-hide-emphasis-markers t)

;; Resize Org headings
(dolist (face '((org-level-1 . 1.2)
                (org-level-2 . 1.1)
                (org-level-3 . 1.05)
                (org-level-4 . 1.0)
                (org-level-5 . 1.1)
                (org-level-6 . 1.1)
                (org-level-7 . 1.1)
                (org-level-8 . 1.1))))
;; (set-face-attribute (car face) nil :font my/variable-width-font :weight 'medium :height (cdr face)))

;; Make the document title a bit bigger
;; (set-face-attribute 'org-document-title nil :font my/variable-width-font :weight 'bold :height 1.3)

;; Make sure certain org faces use the fixed-pitch face when variable-pitch-mode is on
(set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
(set-face-attribute 'org-table nil :inherit 'fixed-pitch)
(set-face-attribute 'org-formula nil :inherit 'fixed-pitch)
(set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

;;; Centering Org Documents --------------------------------

;; Install visual-fill-column
(unless (package-installed-p 'visual-fill-column)
  (package-install 'visual-fill-column))

;; Configure fill width
(setq visual-fill-column-width 110
      visual-fill-column-center-text t)

;;; Org Present --------------------------------------------

;; Install org-present if needed
(unless (package-installed-p 'org-present)
  (package-install 'org-present))

(defun my/org-present-prepare-slide (buffer-name heading)
  ;; Show only top-level headlines
  (org-overview)

  ;; Unfold the current entry
  (org-show-entry)

  ;; Show only direct subheadings of the slide but don't expand them
  (org-show-children))

(defun my/org-present-start ()
  ;; Tweak font sizes
  (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
                                     (header-line (:height 2.0) variable-pitch)
                                     (org-document-title (:height 1.75) org-document-title)
                                     (org-code (:height 1.55) org-code)
                                     (org-verbatim (:height 1.55) org-verbatim)
                                     (org-block (:height 1.25) org-block)
                                     (org-block-begin-line (:height 0.7) org-block)))

  ;; Set a blank header line string to create blank space at the top
  (setq header-line-format " ")

  ;; Display inline images automatically
  (org-display-inline-images)

  ;; Center the presentation and wrap lines
  (visual-fill-column-mode 1)
  (visual-line-mode 1))

(defun my/org-present-end ()
  ;; Reset font customizations
  (setq-local face-remapping-alist '((default variable-pitch default)))

  ;; Clear the header line string so that it isn't displayed
  (setq header-line-format nil)

  ;; Stop displaying inline images
  (org-remove-inline-images)

  ;; Stop centering the document
  (visual-fill-column-mode 0)
  (visual-line-mode 0))

;; Turn on variable pitch fonts in Org Mode buffers
(add-hook 'org-mode-hook 'variable-pitch-mode)

;; Register hooks with org-present
(add-hook 'org-present-mode-hook 'my/org-present-start)
(add-hook 'org-present-mode-quit-hook 'my/org-present-end)
(add-hook 'org-present-after-navigate-functions 'my/org-present-prepare-slide)
#+end_src

#+RESULTS:
| my/org-present-prepare-slide |

#+begin_src emacs-lisp
(setq org-hide-emphasis-markers t)
#+end_src

#+RESULTS:
: t

* Utils
#+begin_src emacs-lisp
(defun blw/insert-code-file-line-number ()
  (interactive)
  (insert (format "%s-%s"
                  (buffer-file-name)
                  (what-line))))
#+end_src

#+RESULTS:
: blw/insert-code-file-line-number

* Clojure
** More colors (for native functions)

# ;;   (add-hook! erc-twitch-mode-hook #'erc-colorize-enable)
#+begin_src emacs-lisp :tangle packages.el
(package! clojure-mode-extra-font-locking)
#+end_src

#+begin_src emacs-lisp
;; '(require 'clojure-mode-extra-font-locking)
;; (eval-after-load 'clojure-mode '(require 'clojure-mode-extra-font-locking))
;; (add-hook! clojure-mode #'clojure-mode-extra-font-locking)
#+end_src

#+RESULTS:
** User evals on-the-fly, (Reitit course inspired)
#+begin_src emacs-lisp
(defmacro blw/define-user-eval-reitit (fn-name command)
  `(defun ,fn-name ()
    (interactive)
    (cider-eval-file (format (concat (getenv "CLJ_PLAYGROUND") "dev/src/user.clj"))) ;; "/path-to/dev/src/user.clj"
    (cider-interactive-eval
      (format (concat "(" ,command ")")
              (cider-last-sexp)))))

(blw/define-user-eval-reitit blw/eval-go "go")
(blw/define-user-eval-reitit blw/eval-halt "halt")
(blw/define-user-eval-reitit blw/eval-reset "reset")
;; (define-key cider-mode-map (kbd "C-c g") 'blw/eval-go)

(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("c" . "clojure")
        :desc "go - start reitit" "g" #'blw/eval-go
        :desc "halt reitit server" "h" #'blw/eval-halt
        :desc "reset reitit server" "r" #'blw/eval-reset)))
#+end_src

#+RESULTS:
: blw/eval-reset

#+begin_src emacs-lisp
;; (getenv "CLJ")
;; (format (concat (getenv "CLJ_PLAYGROUND") "dev/src/user.clj"))
;; (getenv "CLJ_PLAYGROUND")
#+end_src

#+RESULTS:
** Unit testing
*** Cider
#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("c" . "clojure")
        (:prefix ("t" . "tests")
          :desc "Run all tests" "p" #'cider-test-run-project-tests
          :desc "Run tests in namespace" "n" #'cider-test-run-ns-tests
          :desc "Run test under point" "t" #'cider-test-run-test))))
#+end_src

#+RESULTS:
: cider-test-run-test

* Neo-tree
#+begin_src emacs-lisp :tangle packages.el
(package! neotree)
#+end_src
* AI
** Khoj
#+begin_src emacs-lisp :tangle packages.el
(package! khoj)
#+end_src
** OpenAI
#+begin_src emacs-lisp
;; if you are using the "pass" password manager
;; (setq chatgpt-shell-openai-key
;;         (nth 0 (process-lines "pass" "show" "AI/open")))
;; (setq openai-key (nth 0 (process-lines "pass" "show" "AI/open")))
#+end_src

#+begin_src emacs-lisp :tangle packages.el
(package! tblui)
;; (package! chatgpt
;;   :recipe
;;   (:host github
;;    :repo "emacs-openai/chatgpt.el"))
#+end_src

#+begin_src emacs-lisp
;; (add-to-list 'load-path "~/doom-emacs/lisp/")
;; (require 'codegpt)
;; (require 'chatgpt)
;; (package! chatgtp
;;   :recipe (:host jcs-elpa
;;            :repo "https://jcs-emacs.github.io/jcs-elpa/packages/")) ;; Optional: specify a specific commit or version

;; (package! codegtp)
  ;; :recipe (:host jcs-elpa))
           ;; :repo "https://github.com/emacs-openai/codegpt")) ;; Optional: specify a specific commit or version

;; (package! codegtp)
#+end_src

#+begin_src emacs-lisp :tangle packages.el
;; (package! chatgpt-shell
;;   :recipe
;;   (:host github
;;    :repo "xenodium/chatgpt-shell"))
#+end_src

#+begin_src emacs-lisp
(add-to-list 'package-archives '( "jcs-elpa" . "https://jcs-emacs.github.io/jcs-elpa/packages/") t)
(setq package-archive-priorities '(("melpa"    . 5)
                                   ("jcs-elpa" . 0)))
#+end_src

#+RESULTS:
: ((melpa . http://melpa.org/packages/) (org . http://orgmode.org/elpa/) (gnu . https://elpa.gnu.org/packages/) (jcs-elpa . https://jcs-emacs.github.io/jcs-elpa/packages/))

#+begin_src emacs-lisp :tangle packages.el
;; (package! dall-e
;;   :recipe
;;   (:host github
;;    :repo "emacs-openai/dall-e"
;;    :files ("*.el")))

;; (package! chatgpt
;;   :recipe
;;   (:host github
;;    :repo "emacs-openai/chatgpt"
;;    :files ("*.el")))
#+end_src

#+begin_src emacs-lisp
;; (require 'chatgpt-shell)
;; (require 'dall-e-shell)
#+end_src
* LaTeX (Org/Markdown PDF exports with rich code-colors)
** Pygments
#+begin_src emacs-lisp
(eval-after-load "tex"
  '(setcdr (assoc "LaTeX" TeX-command-list)
    '("%`%l%(mode) -shell-escape%' %t"
      TeX-run-TeX nil (latex-mode doctex-mode) :help "Run LaTeX")))
#+end_src

#+RESULTS:
| %`%l%(mode) -shell-escape%' %t | TeX-run-TeX | nil | (latex-mode doctex-mode) | :help | Run LaTeX |


#+name: setup-minted
#+begin_src emacs-lisp :exports both :results silent
(setq org-latex-listings 'minted)
(setq org-latex-custom-lang-environments
      '((emacs-lisp "common-lispcode")))
(setq org-latex-minted-options
      '(("frame" "none")
        ("fontsize" "\\scriptsize")
        ("linenos" "false")
        ("bgcolor" "LightGray")))
(setq org-latex-to-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
#+end_src
* Pins
#+begin_src emacs-lisp :tangle packages.el
;; (package! treemacs :pin "7c6628a241845cd8f626d2603f747f777de4eefb")
#+end_src

* Self-management with Emacs
** CALFW (Calendar FrameWork)
#+begin_src emacs-lisp :tangle packages.el 
(package! calfw)
(package! calfw-org)
(package! calfw-ical)
#+end_src

#+begin_src emacs-lisp
;; (use-package! calfw-ical)
(defun blw/calendar ()
  (interactive)
  (cfw:open-calendar-buffer
   :contents-sources
   (list
    (cfw:org-create-source "Green")  ; orgmode source
    ;; (cfw:howm-create-source "Blue")  ; howm source
    ;; (cfw:cal-create-source "Orange") ; diary source
    ;; (cfw:ical-create-source "Moon" "~/moon.ics" "Gray")  ; ICS source1
    ;; (cfw:ical-create-source "gcal" (nth 0 (process-lines "pass" "show" "CALFW/gmail-ical-url-facti" "Red")))
    (cfw:ical-create-source "gcal" (nth 0 (process-lines "pass" "show" "CALFW/gmail-ical-url")) "Blue")))) ; google calendar ICS
#+end_src

#+RESULTS:
: blw/calendar
* Beauty
#+begin_src emacs-lisp :tangle packages.el
(package! highlight-indentation)
#+end_src

#+begin_src emacs-lisp
(use-package! highlight-indentation
  :hook (prog-mode . highlight-indentation-mode)
  :config
   (set-face-background 'highlight-indentation-face "#0eeeAA")  
   (set-face-background 'highlight-indentation-current-column-face "#c3b3b3"))
#+end_src

#+RESULTS:
| highlight-indentation-mode | copilot-mode | highlight-indent-guides-mode | hl-todo-mode | display-line-numbers-mode | highlight-numbers-mode | vi-tilde-fringe-mode | editorconfig-major-mode-hook |

* EXWM
** Basic loading
#+begin_src emacs-lisp :tangle packages.el
(package! exwm)
#+end_src

#+begin_src emacs-lisp
;; EXWM init function
(load! "./blw-func/exwm-init.el")
#+end_src

#+begin_src emacs-lisp
(add-hook 'exwm-init 'blw/exwm-init)
#+end_src

#+begin_src emacs-lisp :tangle ./blw-func/exwm-init.el
  (defun blw/exwm-init ()
    (interactive)
    (load! "$HOME/.doom.d/my-func/exwm.el"))
;; (load! "$HOME/.doom.d/desktop.el"))

  (defun efs/exwm-update-class ()
    (exwm-workspace-rename-buffer exwm-class-name))
#+end_src

** Configs


