.doom.d/Emacs.org
*** Workspace
#+begin_src emacs-lisp :tangle ./blw-func/exwm.el
;;; ../dotfiles/.doom.d/my-func/exwm.el -*- lexical-binding: t; -*-
(setq exwm-workspace-number 5)

;; When window "class" updates, use it to set the buffer name
(add-hook 'exwm-update-class-hook #'efs/exwm-update-class)

;; Rebind CapsLock to Ctrl
;;(start-process-shell-command "xmodmap" nil "xmodmap ~/.emacs.d/exwm/Xmodmap")

;; Load the system tray before exwm-init
(require 'exwm-systemtray)
(exwm-systemtray-enable)

;; These keys should always pass through to Emacs
(setq exwm-input-prefix-keys
    '(?\C-x
        ?\C-u
        ?\C-h
        ?\M-x
        ?\M-`
        ?\M-&
        ?\M-:
        ?\C-\M-j  ;; Buffer list
        ?\C-\ ))  ;; Ctrl+Space

;; Ctrl+Q will enable the next key to be sent directly
(define-key exwm-mode-map [?\C-q] 'exwm-input-send-next-key)

;; Set up global key bindings.  These always work, no matter the input state!
;; Keep in mind that changing this list after EXWM initializes has no effect.
(setq exwm-input-global-keys
      `(
        ;; Reset to line-mode (C-c C-k switches to char-mode via exwm-input-release-keyboard)
        ([?\s-r] . exwm-reset)

        ;; Move between windows
        ([s-left] . windmove-left)
        ([s-right] . windmove-right)
        ([s-up] . windmove-up)
        ([s-down] . windmove-down)

        ;; Launch applications via shell command
        ([?\s-&] . (lambda (command)
                     (interactive (list (read-shell-command "$ ")))
                     (start-process-shell-command command nil command)))

        ;; Switch workspace
        ([?\s-w] . exwm-workspace-switch)
        ([?\s-`] . (lambda () (interactive) (exwm-workspace-switch-create 0)))

        ;; 's-N': Switch to certain workspace with Super (Win) plus a number key (0 - 9)
        ,@(mapcar (lambda (i)
                    `(,(kbd (format "s-%d" i)) .
                      (lambda ()
                        (interactive)
                        (exwm-workspace-switch-create ,i))))
                  (number-sequence 0 9))))

(exwm-enable)
#+end_src

*** Monitor setup
#+begin_src emacs-lisp :tangle ./blw-func/exwm.el
(require 'exwm-randr)
(setq exwm-randr-workspace-output-plist '(0 "eDP1"))
(add-hook 'exwm-randr-screen-change-hook
      (lambda ()
        (start-process-shell-command
         "xrandr" nil "xrandr --output eDP1 --right-of HDMI-1-0 --auto")))
(start-process-shell-command "xrandr" nil "xrandr --output eDP-1 --primary --mode 1920x1080 --pos 0x0 --rotate normal --output DP-1 --off --output DP-2 --off --output HDMI-1 --mode 2560x1080 --pos 1920x0 --rotate normal")
(setq exwm-randr-workspace-monitor-plist '(2 "eDP-1" 3 "HDMI-1"))
(exwm-randr-enable)
#+end_src
*** Polybar
#+begin_src emacs-lisp
  ;; Make sure the server is started (better to do this in your main Emacs config!)
  (server-start)

  (defvar efs/polybar-process nil
    "Holds the process of the running Polybar instance, if any")

  (defun efs/kill-panel ()
    (interactive)
    (when efs/polybar-process
      (ignore-errors
        (kill-process efs/polybar-process)))
    (setq efs/polybar-process nil))

  (defun efs/start-panel ()
    (interactive)
    (efs/kill-panel)
    (setq efs/polybar-process (start-process-shell-command "polybar" nil "polybar panel")))

  (defun efs/send-polybar-hook (module-name hook-index)
    (start-process-shell-command "polybar-msg" nil (format "polybar-msg hook %s %s" module-name hook-index)))

  (defun efs/send-polybar-exwm-workspace ()
    (efs/send-polybar-hook "exwm-workspace" 1))

  ;; Update panel indicator when workspace changes
  (add-hook 'exwm-workspace-switch-hook #'efs/send-polybar-exwm-workspace)
#+end_src

#+RESULTS:
| efs/send-polybar-exwm-workspace | exwm-systemtray--on-workspace-switch |
*** Inits
#+begin_src emacs-lisp :tangle ./blw-func/exwm.el
(defun efs/exwm-init-hook ()
  ;;   ;; Make workspace 1 be the one where we land at startup
  (exwm-workspace-switch-create 1)

  ;;   ;; Open eshell by default
  ;;   ;; (eshell)

  ;;   ;; NOTE: The next two are disabled because we now use Polybar!

  ;;   ;; Show battery status in the mode line
  (display-battery-mode 1)

  ;;   ;; Show the time and date in modeline
  (setq display-time-day-and-date t)
  (display-time-mode 1)
  ;;   ;; Also take a look at display-time-format and format-time-string

  ;;   ;; Start the Polybar panel
  ;; (efs/start-panel)

  ;;   ;; Launch apps that will run in the background
  (efs/run-in-background "dunst")
  (efs/run-in-background "nm-applet")
  (efs/run-in-background "pasystray")
  (efs/run-in-background "blueman-applet")
  (efs/start-panel))
#+end_src

** TMUX
#+begin_src emacs-lisp
  ;; "/run/user/1000/tmux-1000/default"
#+end_src

* Packages dependencies
#+begin_src emacs-lisp :tangle packages.el
  ;; (package! edwina)
  ;; (package! evil-multiedit)
  ;; (package! all-the-icons-completion)
  ;; (package! all-the-icons-ivy)
  ;; (package! all-the-icons-ibuffer)
  ;; (package! dashboard)
  ;; (package! quelpa-use-package)
  ;; (package! eaf)
  ;; (package! epc)
  ;; (package! ctable)
  ;; (package! deferred)
  ;; (package! s)
  ;; (package! elmacro)
  ;; ;; (package! chembalance)
  ;; (package! chemtable)
  ;; (package! calfw-org)
  ;; (package! calfw-cal)
  ;; (package! calfw-ical)
  ;; (package! calfw-gcal)
  ;; (package! ox-reveal)
  ;; (package! htmlize)
  ;; (package! celestial-mode-line)
  ;; (package! sunshine)
  ;; (package! evil-nerd-commenter)
#+end_src

#+begin_src emacs-lisp
  ;; (use-package! evil-nerd-commenter)
#+end_src
* Cape

#+begin_src emacs-lisp :tangle packages.el
(package! cape)
#+end_src

#+begin_src emacs-lisp
;; Add extensions
(use-package! cape
  ;; Bind dedicated completion commands
  ;; Alternative prefix keys: C-c p, M-p, M-+, ...
  :bind (("C-c p p" . completion-at-point) ;; capf
         ("C-c p t" . complete-tag)        ;; etags
         ("C-c p d" . cape-dabbrev)        ;; or dabbrev-completion
         ("C-c p h" . cape-history)
         ("C-c p f" . cape-file)
         ("C-c p k" . cape-keyword)
         ("C-c p s" . cape-elisp-symbol)
         ("C-c p e" . cape-elisp-block)
         ("C-c p a" . cape-abbrev)
         ("C-c p l" . cape-line)
         ("C-c p w" . cape-dict)
         ("C-c p :" . cape-emoji)
         ("C-c p \\" . cape-tex)
         ("C-c p _" . cape-tex)
         ("C-c p ^" . cape-tex)
         ("C-c p &" . cape-sgml)
         ("C-c p r" . cape-rfc1345))
  :init
  ;; Add to the global default value of `completion-at-point-functions' which is
  ;; used by `completion-at-point'.  The order of the functions matters, the
  ;; first function returning a result wins.  Note that the list of buffer-local
  ;; completion functions takes precedence over the global list.
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-elisp-block)
  ;;(add-to-list 'completion-at-point-functions #'cape-history)
  ;;(add-to-list 'completion-at-point-functions #'cape-keyword)
  ;;(add-to-list 'completion-at-point-functions #'cape-tex)
  ;;(add-to-list 'completion-at-point-functions #'cape-sgml)
  ;;(add-to-list 'completion-at-point-functions #'cape-rfc1345)
  ;;(add-to-list 'completion-at-point-functions #'cape-abbrev)
  ;;(add-to-list 'completion-at-point-functions #'cape-dict)
  ;;(add-to-list 'completion-at-point-functions #'cape-elisp-symbol)
  ;;(add-to-list 'completion-at-point-functions #'cape-line)
  :config
  (global-set-key (kbd "M-<return>") (cape-capf-interactive #'codeium-completion-at-point)))


#+end_src

* Codeium

#+begin_src emacs-lisp :tangle packages.el
(package! codeium :recipe (:host github :repo "Exafunction/codeium.el"))
;; (package! cape)
#+end_src

#+begin_src emacs-lisp
(use-package! codeium
  :after cape
  :init
  ;; use globally
  (add-to-list 'completion-at-point-functions #'codeium-completion-at-point)

  :config

  (setq codeium/metadata/api_key (nth 1 (process-lines "pass" "show" "apikeys/codeium")))
  (defalias 'my/codeium-complete
    (cape-interacive-capf #'codeium-completion-at-point))

  (map! :localleader
        :map evil-normal-state-map
        "c e" #'my/codeium-complete)

  (setq codeium-api-enabled
        (lambda (api)
          (memq api '(GetCompletions Heartbeat CancelRequest
                      GetAuthToken RegisterUser auth-redirect
                      AcceptCompletion))))

  ;; ----------
  (setq use-dialog-box nil) ;; do not use popup boxes

  ;; if you don't want to use customize to save the api-key
  ;; (setq codeium/metadata/api_key "xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx")

  ;; get codeium status in the modeline
  (setq codeium-mode-line-enable
         (lambda (api) (not (memq api '(CancelRequest Heartbeat AcceptCompletion)))))
  (add-to-list 'mode-line-format '(:eval (car-safe codeium-mode-line)) t)
  ;; alternatively for a more extensive mode-line
  ;; (add-to-list 'mode-line-format '(-50 "" codeium-mode-line) t)

  ;; use M-x codeium-diagnose to see apis/fields that would be sent to the local language server
  (setq codeium-api-enabled
         (lambda (api)
              (memq api '(GetCompletions Heartbeat CancelRequest GetAuthToken RegisterUser auth-redirect AcceptCompletion))))
  ;; you can also set a config for a single buffer like this:
  ;; (add-hook 'python-mode-hook
  ;;     (lambda ()
  ;;         (setq-local codeium/editor_options/tab_size 4)))

  ;; You can overwrite all the codeium configs!
  ;; for example, we recommend limiting the string sent to codeium for better performance
  (defun my-codeium/document/text ()
     (buffer-substring-no-properties (max (- (point) 3000) (point-min)) (min (+ (point) 1000) (point-max))))
  ;; if you change the text, you should also change the cursor_offset
  ;; warning: this is measured by UTF-8 encoded bytes
  (defun my-codeium/document/cursor_offset ()
     (codeium-utf8-byte-length
      (buffer-substring-no-properties (max (- (point) 3000) (point-min)) (point))))
  (setq codeium/document/text 'my-codeium/document/text)
  (setq codeium/document/cursor_offset 'my-codeium/document/cursor_offset))
#+end_src

* Company

#+begin_src emacs-lisp
(use-package! company
    :defer 0.1
    :config
    (global-company-mode t)
    (setq-default
        company-idle-delay 0.5
        company-require-match nil
        company-minimum-prefix-length 0

        ;; get only preview
        ;; company-frontends '(company-preview-frontend)))
        ;; also get a drop down
        company-frontends '(company-pseudo-tooltip-frontend company-preview-frontend)))

#+end_src

#+RESULTS:
: t

* Corfu
#+begin_src emacs-lisp :tangle packages.el
(package! corfu)
#+end_src

#+begin_src emacs-lisp
(use-package! corfu
  ;; Optional customizations
  :custom
  (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
  (corfu-auto t)                 ;; Enable auto completion
  (corfu-separator ?\s)          ;; Orderless field separator
  (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
  (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
  (corfu-preview-current nil)    ;; Disable current candidate preview
  (corfu-preselect 'prompt)      ;; Preselect the prompt
  (corfu-on-exact-match nil)     ;; Configure handling of exact matches
  (corfu-scroll-margin 5)        ;; Use scroll margin

  ;; Enable Corfu only for certain modes.
  :hook ((prog-mode . corfu-mode)
         (shell-mode . corfu-mode)
         (eshell-mode . corfu-mode))

  ;; Recommended: Enable Corfu globally.  This is recommended since Dabbrev can
  ;; be used globally (M-/).  See also the customization variable
  ;; `global-corfu-modes' to exclude certain modes.
  :init
  (global-corfu-mode))
#+end_src

* HTTP interface
#+begin_src emacs-lisp :tangle packages.el
(package! http)
#+end_src

#+begin_src http
# -*- http -*-

POST http://localhost:8009/products
User-Agent: Emacs
Content-Type: application/json

{
 "name" : "MyProduct",
 "price": 100
}
#+end_src

You can issue the http request by: =M-x http-process (C-c C-c)=
