.doom.d/Emacs.org
* Language learning
#+begin_src emacs-lisp :tangle packages.el
(package! google-translate)
(package! google)
(package! posframe)
(package! go-translate)
#+end_src

#+begin_src emacs-lisp :tangle no
;; (use-package! go-translate
;;   :config
(setq gt-translate-list '(("en" "zh")
                          ("en" "ru")
                          ("en" "pt-br")
                          ("pt-br" "en")))

(setq gt-default-translator
        (gt-translator
         :taker   (gt-taker :text 'buffer :pick 'paragraph)
         :engines (list (gt-bing-engine)
                        (gt-google-engine)
                        (gt-google-rpc-engine))
         :render
         (gt-buffer-render)))

(setq gt-buffer-evil-leading-key "x")
       ;; (gt-posframe-pop-render))
#+end_src

#+RESULTS:
: x
* Telegram

#+begin_src emacs-lisp
(setq telega-server-libs-prefix "~/dotfiles/gitthigs/td/")
#+end_src

#+RESULTS:
: ~/dotfiles/gitthigs/td/
* Germanium/Carbon

#+begin_src emacs-lisp :tangle packages.el
(package! germanium)
#+end_src
* Tree-sitter

#+begin_src emacs-lisp
;; (setq treesit-extra-load-path "/home/kolmogorov/.emacs.d/.local/straight/build-30.0.50/tree-sitter-langs/")
#+end_src

#+begin_src emacs-lisp
(setq +tree-sitter-hl-enabled-modes t)
#+end_src

#+RESULTS:
: t

* YAML
#+begin_src emacs-lisp :tangle packages.el
(package! yaml-mode)
#+end_src

* Misc
#+begin_src emacs-lisp :tangle packages.el
(package! eglot-signature-eldoc-talkative)
#+end_src

#+begin_src emacs-lisp :tangle packages.el
(package! protobuf-mode)
#+end_src
* EMMS (Music)

#+begin_src emacs-lisp :tangle ./packages.el
(package! emms)
(package! emms-soundcloud)
#+end_src

* Ewal (Emacs pywal)
#+begin_src emacs-lisp
(load! "./blw-func/ewal.el")
#+end_src

* Yazi integration

The command defaults to the =x-terminal-emulator= option. To change it,

#+begin_src shell
sudo update-alternatives --config x-terminal-emulator
#+end_src

#+begin_src emacs-lisp
;; defines blw/run-yazi
(load! "./blw-func/yazi.el")

;; binding
(map! :leader
      (:prefix-map ("b" . "buddhi")
        (:prefix ("i" . "(system's) Integrations")
         :desc "Yazi lauch" "y" #'blw/run-yazi)))

(map! :leader
      (:prefix-map ("b" . "buddhi")
        (:prefix ("x" . "command")
         :desc "Yazi-find" "f" #'blw/run-yazi)))
#+end_src

#+RESULTS:
: blw/run-yazi

* Ace-link
#+begin_src emacs-lisp :tangle ./packages.el
(package! ace-link)
#+end_src

* Server
#+begin_src emacs-lisp
(server-force-delete)
(server-start)
#+end_src
